Revit 2027 API
ElectricalSystem.DisconnectPanel Method
 Disconnect the panel for the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DisconnectPanel()
Public Sub DisconnectPanel
public:
void DisconnectPanel()
member DisconnectPanel : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the panel cannot be disconnected for the electrical system.
Remarks
 If successful, the system will disconnect this panel. Otherwise the exception will be thrown. This method will only function with the Autodesk Revit MEP application.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace